geNurb3dTo2d(OdGeNurbCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePlane*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeNurbCurve2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Converts a 3D NURBS curve to a 2D NURBS curve by projecting it onto the specified plane.
\param nurb3d [in]  Any 3D NURBS curve.
\param plane [in]  Projection plane.
\param nurb2d [out]  Receives the 2D NURBS curve.
\param tol [in]  Geometric tolerance.
Corresponding C++ library: TD_Ge